// не решен !!

var a = [100, 103, 106, 4, 200, 201, 202, 203, 9, 10, 200, 12, 13, 500, 402, 403, 404];//200
var n = 17; // a.length
var j = 1;


for(var i = 0; i < n; i++){
	//console.log(a[i]);
	for(j; j < n; j++){
		//console.log(a[j]);
		if(a[j] == a[i]){
			console.log(a[j]);
			console.log(a[j+1]);
		}
		else {
			console.log(0);
		}
	}
}


/*Array44. Дан целочисленный массив размера N, содержащий ровно два одинаковых элемента. Найти номера одинаковых элементов и вывести эти номера в порядке возрастания. */