"use strict"; 
var a = [1, 2, 3, 4, 5, 6, 100, 8, 9, 10];
var n = 10; // a.length
var k = 0;

//  раб
for(var i = n; i >= 0; i--){
	if(a[i] % 2 == 0){
		k = a[i];		
	}
}	
console.log(k);

for(var j = 0; j < n; j++){	
	if(a[j] % 2 == 0){
		a[j] = a[j] * k;
		console.log(a[j]);
	}
}	


/* Не раб
for(var i = 0; i < n; i++){
	if(a[i] % 2 == 0){
		k = a[i];
		for(var j = 0; j < n; j++){	
			if(a[j] % 2 == 0){
				a[j] = a[j] * k;
				console.log(a[j]);
				break;
				
			
			}
	}
	}
}
*/	


/*Array66. Дан целочисленный массив размера N. Увеличить все четные числа, содержащиеся в массиве, на исходное значение первого четного числа. Если четные числа в массиве отсутствуют, то оставить массив без изменений. */